[
     {
        "date": "APRIL 25 - PRESENT",
        "title": "Frontend/WordPress Developer @ Titeknit Limited",
        "description": "Worked across multiple UK-based WordPress projects, building and maintaining custom websites for commercial clients including construction suppliers, energy companies, and product-focused businesses. Developed custom post types and implemented Advanced Custom Fields (ACF) to structure content and enable easy client-managed updates. Contributed to frontend development using HTML, CSS, and JavaScript to deliver responsive, accessible, and user-friendly interfaces. Diagnosed and resolved issues related to plugins such as Elementor and WooCommerce, ensuring site stability and performance. Provided ongoing site maintenance, updates, and bug fixes following project delivery.",
        "skills": ["PHP", "HTML", "CSS", "JavaScript", "WordPress", "ACF", "WooCommerce", "Elementor"]
    },
    {
        "date": "JULY 24 - AUG 24",
        "title": "WordPress Developer @ Bonsai Digital",
        "description": "For this freelance project I built a custom WordPress theme to be used as an interactive display in the Royal artillery Museum in Doncaster. I built the frontend in accordance with the clients specifications to ensure a responsive, accessible and user-friendly interface. I created custom fields within WordPress to store specific data for display purposes. I Utilized PHP to retrieve and dynamically display data from the WordPress backend. I ensured seamless integration of multimedia elements and interactive features for an engaging user experience.",
        "skills": ["PHP", "HTML", "CSS", "MYSQL", "JavaScript", "WordPress"]
    },
    {
        "date": "JAN 22 - DEC 23",
        "title": "Software Engineer @ Credera UK",
        "description": "As part of my apprenticeship my work placement was at a company called Credera UK, Credera is a tech consultancy firm, so I had the opportunity to work on various projects for global companies and worked with many different Tech stacks. Some of the projects I worked on are as follows Providing software testing and platform building, building a React sales dashboard for a global company, creating a contract automation tool with Power Automate, Building a resourcing tool full stack application. Implemented SEO strategies to improve website visibility and search engine rankings. Ensured web content adhered to accessibility guidelines, enhancing user experience for all visitors. Working in an agile/scrum environment, meeting sprint commitments and following the agile methodology.  ",
        "skills": ["React", "HTML", "CSS", "MYSQL", "JavaScript", "Figma", "Azure", "Docker", "Java", "Power Automate", "Power Apps", "Terraform", "Ansible"]
    },
    {
        "date": "MAY 21 - JUL 21",
        "title": "WordPress Developer @ Wool Digital",
        "description": "I did a voluntary project to build up some professional experience building a custom WordPress Theme for a non-profit organisation in York. Following the client specification to create user features such as event Calander with booking function. News page, blog page and contact form page. Customizable image slider. Ensured web content adhered to accessibility guidelines, enhancing user experience for all visitors.Designing the functionality of the site using HTML, CSS and JavaScript with PHP functionality to create the WordPress theme. Gave consulting services and guidance to the client on how to update the site ",
        "skills": ["PHP", "HTML", "CSS", "MYSQL", "JavaScript", "WordPress", "JQuery"]
    }
]